CFD/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    south
    {
        type            symmetryPlane;
    }

    east
    {
        type            zeroGradient;
    }

    north
    {
        type            symmetryPlane;
    }

    west
    {
        type            uniformFixedValue;
        uniformValue    constant (5 0 0);
    }

    cylinder
    {
        type            noSlip;
    }

    ceiling
    {
        type            zeroGradient;
    }
    floor
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
