CFD/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    south
    {
        type            symmetryPlane;
    }

    east
    {
        type            fixedValue;
        value           uniform 0;
    }

    north
    {
        type            symmetryPlane;
    }

    west
    {
        type            zeroGradient;
    }

    cylinder
    {
        type            zeroGradient;
    }

    ceiling
    {
        type            zeroGradient;
    }
    floor
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
