CFD/0/phiIB
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      phiB;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    north
    {
        type            symmetryPlane;
    }
    south
    {
        type            symmetryPlane;
    }
    east
    {
        type            zeroGradient;
    }
    west
    {
        type            zeroGradient;
    }
    ceiling
    {
        type            zeroGradient;
    }
    floor
    {
        type            zeroGradient;
    }
    cylinder
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
